/****************************************************************************
* File:			buzz.h														*
* Created:		2015-02-13													*
* Last Change:																*
* Author:		chen zhi peng 												*
* Description:																*
****************************************************************************/
#ifndef _buzz_H
#define _buzz_H

#include "reg52.h"



/**************************************************************************** 
* 宏定义
****************************************************************************/		
#define BUZZ_EN			0			//蜂鸣器--响
#define BUZZ_CL			1			//蜂鸣器--静


//**************蜂鸣器鸣响方式*******************//
#define BUZZ_NA					1			//无鸣响
#define BUZZ_B					2			//哔(只响一声，用于按键操作)
#define BUZZ_BB					3			//哔哔(只响两声，用于按键操作)
#define BUZZ_BBB				11			//哔哔(只响三声，用于按键操作)
#define BUZZ_BB_B				12			//哔(长鸣1秒)~~~哔
#define BUZZ_BB_B_B				13			//哔(长鸣1秒)~~~哔~~~哔
#define BUZZ_BB_B_B_B			14			//哔(长鸣1秒)~~~哔~~~哔~~~哔
#define BUZZ_BB_BB				15			//哔(长鸣1秒)~~~哔(长鸣1秒)

#define BUZZ_B02				4			//哔~~~200毫秒	
#define BUZZ_B2					5			//哔~~~~2秒频率
#define BUZZ_BB2				6			//哔哔~~~2秒频率
#define BUZZ_BBB2				7			//哔哔哔~~~~2秒频率
#define BUZZ_B_B				8			//哔(长鸣1秒)~~~~哔
#define BUZZ_B_BB				9			//哔(长鸣1秒)~~~~哔哔
#define BUZZ_B_BBB				10			//哔(长鸣1秒)~~~~哔哔哔
//**************蜂鸣器鸣响时间*******************//
#define BUZZ_MOTOR_T			220			//电机故障类鸣响时间
#define BUZZ_OTH_T				220			//其他故障鸣响时间
#define BUZZ_INF_T				50			//未刷开在感应区鸣响时间
#define BUZZ_FOLOWERME_T		60			//尾随鸣响时间
#define BUZZ_LOOTRUN_T			20			//抢行鸣响时间
#define BUZZ_STOP1_T			250			//严重停机鸣响1时间(电机故障类)
#define BUZZ_STOP2_T			250			//严重停机鸣响2时间





/**************************************************************************** 
* 使用端口定义
****************************************************************************/
#define	PORT_BUZZ			P1
#define	B_BUZZ				1
sbit	BUZZ				= PORT_BUZZ ^ B_BUZZ;




/**************************************************************************** 
* 变量定义/声明
****************************************************************************/
extern volatile u8 xdata BuzzMode;
extern volatile u8 data BuzzNum;



/**************************************************************************** 
* 函数原型
****************************************************************************/
void Buzz_task(u8 mode);
void Buzz_clk();
void intBuzz();

#endif