/****************************************************************************
* File:			clk.h														*
* Created:		2017-02-13													*
* Last Change:																*
* Author:		chen zhi peng 												*
* Description:																*
****************************************************************************/
#ifndef	__CLK_H
#define	__CLK_H

#include "reg52.h"
#include "ERR.h"
#include "buzz.h"
#include "INPUT.H"
#include "MOTOR.H"
#include "Output.h"
#include "USART.h"
#include "RUN.h"









/**************************************************************************** 
* 宏定义
****************************************************************************/
#define T10MS_TIME			10
#define T100MS_TIME			10
#define T1000MS_TIME		10


















/**************************************************************************** 
* 使用端口定义
****************************************************************************/





/**************************************************************************** 
* 变量定义/声明
****************************************************************************/
extern volatile u8 T10MS;		//10毫秒计量变量
extern volatile u8 T100MS;		//100毫秒计量变量
extern volatile u8 T1000MS; 	//1000毫秒计量变量



extern volatile u16 xdata test;		//主程序在100MS内循环跑N次，此参数可观察单片机运行效率
extern volatile u16 xdata test_dly;	//主程序在100MS内循环跑N次，用作数码管显示使用










/**************************************************************************** 
* 函数原型
****************************************************************************/
void clk();
void intclk();
void T1Ms_clk();	










#endif


